#include<stdio.h>
#include<math.h>
int main()
{
//	int a;
//	a=11111*11111;		//1234554321
//	a=111111*111111;	//-539247567  溢出(2^32)
//	a=111111111*111111111;		//1653732529
	
	double a;
//	a=11111*11111;
//	a=11111*11111.0;	//123454321.000000
	a=111111*111111;	//-539247567.000000		（原因，第一步是按整数算111111*111111，再转换成浮点型，
//	a=111111.0*111111.0;	//12345654321.000000		这个是整数处理时溢出，产生错误结果，转为了浮点型）预先把数变为浮点型或（double）
//	a=111111111*111111111;	//1653732529.000000
	printf("%lf\n",a);

	printf("%lf\n",sqrt(-10));		//-nan(ind)
//	printf("%lf\n",1.0/0.0);		//-nan(ind)
//	printf("%lf\n",0.0/0.0);		//-nan(ind)
//	printf("%d\n",1/0);	
	return 0;
}
/*
会返回 NaN 的运算有如下三种：
1. 操作数中至少有一个是 NaN 的运算
2. 未定义操作
	下列除法运算：0/0、∞/∞、∞/−∞、−∞/∞、−∞/−∞
	下列乘法运算：0×∞、0×-∞
	下列加法运算：∞ + (−∞)、(−∞) + ∞
	下列减法运算：∞ - (−∞)、(−∞) - ∞
3. 产生复数结果的实数运算。例如：
	对负数进行开方运算
	对负数进行对数运算
	对比-1小或比+1大的数进行反正弦或反余弦运算
*/